JS-CS-Detection-byExample/Dataset (ALERT 5 GB)/374130/spot-1.2.5/spot-1.2.5/doc/userdoc/randltl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>randltl</code></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="<code>randltl</code>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-21T17:42+0200"/>
<meta name="author" content="Alexandre Duret-Lutz"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="http://spot.lip6.fr/css/spot-zenburn.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:center;white-space:nowrap;">
 <a accesskey="h" href="tools.html">UP</a> | <a accesskey="H" href="tools.html">HOME</a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><code>randltl</code></h1>

<p>This tool generates random formulas.  By default, it will generate one
random LTL formula using atomic propositions supplied on the
command-line.  It can be instructed to generate random Boolean or PSL
formulas instead, but let us first focus on LTL generation.
</p>
<p>
For instance to obtain one random LTL formula over the propositions
<code>a</code>, <code>b</code>, or <code>c</code>, use:
</p>



<pre class="src src-sh">randltl a b c
</pre>

<pre class="example">
G(Gb W (Gb M c))
</pre>


<p>
Note that the result does not always use all atomic propositions.
</p>
<p>
If you do not care about how the atomic propositions are named,
you can give a nonnegative number instead:
</p>



<pre class="src src-sh">randltl 3
</pre>

<pre class="example">
G(Gp1 W (Gp1 M p2))
</pre>


<p>
The syntax of the formula output can be changed using the
<a href="ioltl.html">common output options</a>:
</p>




<pre class="example">-8, --utf8                 output using UTF-8 characters
    --csv-escape           quote the formula for use in a CSV file
    --format=FORMAT        specify how each line should be output (default:
                           "%f")
-l, --lbt                  output in LBT's syntax
    --latex                output using LaTeX macros
-p, --full-parentheses     output fully-parenthesized formulas
-s, --spin                 output in Spin's syntax
    --spot                 output in Spot's syntax (default)
    --wring                output in Wring's syntax
</pre>


<p>
When you select Spin's or Wring's syntax, operators <code>W</code> and <code>M</code> are
automatically rewritten using <code>U</code> and <code>R</code> (written <code>V</code> for Spin).
When you select LBT's syntax, you should name you atomic propositions
like <code>p0</code>, <code>p1</code>, etc&hellip; (Atomic proposition named differently will be
output by Spot in double-quotes, but this is not supported by LBT.)
</p>



<pre class="src src-sh">randltl -l 3
randltl -8 3
randltl -s 3
randltl --wring 3
</pre>

<pre class="example">
G W G p1 M G p1 p2
□(□p1 W (□p1 M p2))
[]((p2 U (p2 &amp;&amp; []p1)) V ([]p1 || (p2 U (p2 &amp;&amp; []p1))))
(G(((p2=1) U ((p2=1) * (G(p1=1)))) R ((G(p1=1)) + ((p2=1) U ((p2=1) * (G(p1=1)))))))
</pre>


<p>
As you might guess from the above result, for a given set of atomic
propositions (and on the same computer) the generated formula will
always be the same.  This is because each time <code>randltl</code> starts, it
initialize the seed of the random number generator to <code>0</code>.  This seed
can be changed using the <code>--seed</code> option.  For instance the following
three commands:
</p>



<pre class="src src-sh">randltl a b c
randltl --seed=123 a b c
randltl --seed=0 a b c
</pre>


<pre class="example">
G(Gb W (Gb M c))
X((c &lt;-&gt; F(a M Xc)) -&gt; a)
G(Gb W (Gb M c))
</pre>


<p>
Will give three formulas in which the first and last are identical:
</p>
<pre class="example">
G(Gb W (Gb M c))
X((c &lt;-&gt; F(a M Xc)) -&gt; a)
G(Gb W (Gb M c))
</pre>


<p>
When generating random formulas, we usually want large quantity of
them.  Rather than running <code>randltl</code> several times with different
seeds, we can use the <code>-n</code> option to specify a number of formulas to
produce.
</p>



<pre class="src src-sh">randltl -n 5 a b c
</pre>

<pre class="example">
G(Gb W (Gb M c))
!a | (c -&gt; !c) | Fb
(b xor FXb) -&gt; Gb
0
b W !((!a &lt;-&gt; Fb) M Fc)
</pre>


<p>
By default <code>randltl</code> will never output the same formula twice (this
can be changed with the <code>--allow-dups</code> option), so it may generate
more formulas internally than it eventually prints.  To ensure
termination, for each output formula the number of ignored (because
duplicated) random formulas that are generated is limited to 100000.
Therefore in some situations, most likely when generating small
formulas, with few atomic proposition, you may see <code>randltl</code> stop
before the requested number of formulas has been output with an error
message.
</p>
<p>
If the integer passed to <code>-n</code> is negative, <code>randltl</code> will attempt to
generate as many formulas as it can.  This is most useful when
<code>randltl</code> is piped to <code>ltlfilt</code> to select random formulas matching a
certain criterion, as we shall see later.
</p>
<p>
Besides the list of atomic propositions (<code>a b c</code> in our example) and
the seed, several other parameters control the generation of the
random formulas.
</p>
<p>
Initially, the random generator selects a tree size for the formula.
The default size is <code>15</code>, but it can be changed using the <code>--tree-size</code>
option.  For instance in the following, for each formula the tree size
will be chosen randomly in the range <code>22..30</code>.
</p>


<pre class="src src-sh">randltl -n 5 a b c --tree-size=22..30
</pre>

<pre class="example">
((Fc W 0) M 1) &amp; ((a | XXc) M (b W Fb))
G(c &lt;-&gt; (Fa xor ((b xor c) M GXb)))
c &amp; !(Gb M c) &amp; (0 R Ga)
(Xc -&gt; Xa) R (F!c | (a &amp; (c M 1)))
(a W (b xor (c -&gt; Fb))) | (b &lt;-&gt; (a W 0))
</pre>


<p>
The tree size is just the number of nodes in the syntax tree of the
formula during its construction.  However because Spot automatically
applies some <i>trivial simplifications</i> during the construction of its
formulas (e.g., <code>F(F(a)</code> is reduced to <code>F(a)</code>, <code>a&amp;0</code> to <code>0</code>, etc.),
the actual size of the formula output may be smaller than the
tree size specified.
</p>
<p>
It is pretty common to obtain the formulas <code>0</code> or <code>1</code> among the first
formulas output, since many random formulas trivially simplify to
these.  However because duplicate formulas are suppressed by default,
they shall only occur once.
</p>
<p>
Stronger simplifications may be requested using the <code>-r</code> option, that
implements many rewritings that helps Spot translators algorithms (so
beware that using <code>-r</code> reduces the randomness of the output).
</p>



<pre class="src src-sh">randltl -n 5 a b c --tree-size=22..30 -r
</pre>

<pre class="example">
GFc &amp; ((a | XXc) M Fb)
G((!c &amp; ((G!a &amp; (((!b &amp; !c) | (b &amp; c)) W XF!b)) | (Fa &amp; (((!b &amp; c) | (b &amp; !c)) M XGb)))) | (c &amp; ((G!a &amp; (((!b &amp; c) | (b &amp; !c)) M XGb)) | (Fa &amp; (((!b &amp; !c) | (b &amp; c)) W XF!b)))))
c &amp; Ga &amp; (F!b W !c)
X(a | !c) R (F!c | (a &amp; Fc))
(a W (!b &amp; (!c | Fb))) | (!b &amp; F!a)
</pre>


<p>
The generator build the syntax tree recursively from its root, by
considering all operators that could be used for a given tree size (for
example a tree-size of 2 disables binary operators).  A <i>priority</i> is
associated to each operator, and the probability of this operator
being selected is this priority over the sum of the priorities of all
considered operators.  The default priorities for each operator can
be seen with <code>--dump-priorities</code>:
</p>



<pre class="src src-sh">randltl a b c --dump-priorities
</pre>


<pre class="example">Use --ltl-priorities to set the following LTL priorities:
ap      3
false   1
true    1
not     1
F       1
G       1
X       1
equiv   1
implies 1
xor     1
R       1
U       1
W       1
M       1
and     1
or      1
</pre>


<p>
Where <code>ap</code> stands for <i>atomic propositions</i> (<code>a</code>, <code>b</code>, <code>c</code>).  In this
example, when the generator builds a leaf of the syntax tree (i.e., a
subformula of tree-size 1), it must ignore all operators, and chose
between <code>ap</code>, <code>false</code>, or <code>true</code>, and the odds of choosing <code>ap</code> is
3/(3+1+1).
</p>
<p>
As indicated at the top of the output, these priorities can be changed
using the <code>--ltl-priorities</code> options.  The most common scenario is to
disable some of the operators by giving them a null priority.  The
following example disables 6 operators, and augments the priority of
<code>U</code> to 3 to favor its occurrence.
</p>



<pre class="src src-sh">randltl -n 5 a b c --ltl-priorities <span class="org-string">'xor=0,implies=0,equiv=0,W=0,M=0,X=0,U=3'</span>
</pre>

<pre class="example">
F(Fb U (c &amp; Gb))
!a | !b | (0 R Gc)
F(1 U c)
0
b U !((!b R !a) U F!c)
</pre>


<p>
When using <code>-r</code> to simplify generated formulas, beware that these
rewritings may use operators that you disabled during the initial
random generation: you may obtain a formula that uses <code>W</code> even if <code>W</code>
has a null priority.  (You can use <code>ltlfilt</code> to rewrite these
operators if that is a problem.)
</p>
<p>
If the <code>--weak-fairness</code> option is used, for each random formula
generated, a weak-fairness formula of the form <code>GF(a) &amp; GF(b) &amp; GF(c)</code>
is generated for a subset of the atomic propositions and "ANDed" to
the random formula.  The <code>--tree-size</code> option has no influence on the
weak-fairness formula appended.
</p>



<pre class="src src-sh">randltl -n 5 a b c --weak-fairness
</pre>

<pre class="example">
G(Gb W (Gb M c)) &amp; GFb
XX((a M F(!a | c)) | (c &lt;-&gt; (b W 0))) &amp; GFa
GFb &amp; GFa &amp; !(b &lt;-&gt; Fc) &amp; GFc
GFb &amp; GFa &amp; (((c M a) W !a) M X(b | Xc))
GFc &amp; G(!b &lt;-&gt; Fc)
</pre>



<p>
Boolean formulas may be output with the <code>-B</code> option:
</p>


<pre class="src src-sh">randltl -B -n 5 a b c
</pre>

<pre class="example">
!a -&gt; !b
a xor !a
0
c | !c
((a &amp; c) -&gt; !a) &amp; (!b -&gt; !a)
</pre>


<p>
In that case, priorities should be set with <code>--boolean-priorities</code>.
</p>
<p>
Finally, PSL formulas may be output using the <code>-P</code> option.  However
keep in mind that since LTL formulas are PSL formulas, generating
random PSL formula may produce many LTL formulas that do not use any
PSL operator (this is even more so the case when simplifications are
enabled with <code>-r</code>).
</p>



<pre class="src src-sh">randltl -P -n 5 a b c
</pre>

<pre class="example">
G(Gb M ((c &amp; Xb) | (!a M 1)))
{c[*0..3]:{!a | c}}[]-&gt; !a
0
{{1 | [*0]};{{b &amp;&amp; c}}[*2..3]}[]-&gt; 0
!(b R XXb)
</pre>


<p>
As shown with the <code>--dump-priorities</code> output below, tweaking the
priorities used to generated PSL formulas requires three different
options:
</p>



<pre class="src src-sh">randltl -P a b c --dump-priorities
</pre>


<pre class="example">Use --ltl-priorities to set the following LTL priorities:
ap      3
false   1
true    1
not     1
F       1
G       1
X       1
Closure 1
equiv   1
implies 1
xor     1
R       1
U       1
W       1
M       1
and     1
or      1
EConcat 1
UConcat 1
Use --sere-priorities to set the following SERE priorities:
eword   1
boolform        1
star    1
star_b  1
and     1
andNLM  1
or      1
concat  1
fusion  1
Use --boolean-priorities to set the following Boolean formula priorities:
ap      3
false   1
true    1
not     1
equiv   1
implies 1
xor     1
and     1
or      1
</pre>


<p>
The <code>--ltl-priorities</code> option we have seen previously now recognize
some new PSL-specific operators: <code>Closure</code> is the <code>{sere}</code> operator,
<code>EConcat</code> is the <code>{sere}&lt;&gt;-&gt;f</code> operator, and <code>UConcat</code> is the
<code>{sere}[]-&gt;f</code> operator.  When these operator are selected, they
require a SERE argument which is generated according to the priorities
set by <code>--sere-priorities</code>: <code>eword</code> is the empty word, <code>boolform</code> is a
Boolean formula (generated using the priorities set by
<code>--boolean-priorities</code>), <code>star</code> is the unbounded Kleen star, while
<code>star_b</code> is the bounded version, and <code>andNLM</code> is the
non-length-matching variant of the <code>and</code> operator.
</p>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-21T17:42+0200</p>
<p class="author">Author: Alexandre Duret-Lutz</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
